## in 1-11-2020

## this project for my product

In [30]:
import pandas as pd
import numpy as np

my_product = [
    
    ('laptop-mac' , 1000 , 5  , 5000),
    ('laptop-mac' , 2000 , 7  , 14000),
    ('laptop-mac' , 2500 , 9  , 22.500),
    ('laptop-mac' , 3000 , 10 , 30.000),
    ('laptop-mac' , 3100 , 15 , 46.500),
    ('laptop-mac' , 3500 , 20 , 70.000),
    ('laptop-mac' , 5000 , 22, 110.000),
    ('laptop-mac' , 4000 , 25 , 100.000),
    ('laptop-mac' , 7000 , 28, 196.000),
    ('laptop-mac' , 10000 , 5 , 50.000)]

data = pd.DataFrame( my_product , columns=['name' , 'price' , 'quantity' , 'total'])

data.head()

         name  price  quantity    total
0  laptop-mac   1000         5   5000.0
1  laptop-mac   2000         7  14000.0
2  laptop-mac   2500         9     22.5
3  laptop-mac   3000        10     30.0
4  laptop-mac   3100        15     46.5

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   price     10 non-null     int64
 2   quantity  10 non-null     int64
 3   total     10 non-null     float64
dtypes: float64(1), int64(2), object(1)
memory usage: 448.0+ bytes

In [32]:
data.price

0     1000
1     2000
2     2500
3     3000
4     3100
5     3500
6     5000
7     4000
8     7000
9    10000
Name: price, dtype: int64

In [33]:
x = data['quantity']  > 10 
data[x]

         name  price  quantity  total
4  laptop-mac   3100        15   46.5
5  laptop-mac   3500        20   70.0
6  laptop-mac   5000        22  110.0
7  laptop-mac   4000        25  100.0
8  laptop-mac   7000        28  196.0

In [34]:
features = ['quantity']

X = data[features]

X

   quantity
0         5
1         7
2         9
3        10
4        15
5        20
6        22
7        25
8        28
9         5

In [35]:
y = data.price

y

0     1000
1     2000
2     2500
3     3000
4     3100
5     3500
6     5000
7     4000
8     7000
9    10000
Name: price, dtype: int64

In [36]:
from sklearn.model_selection import train_test_split

X_train , X_test , y_train , y_test = train_test_split(X , y , test_size=.3)

In [37]:
from sklearn.linear_model import LinearRegression

model =  LinearRegression()

model.fit(X_train , y_train)

LinearRegression()

In [38]:
model.predict(X_test)

array([4653.68663594, 4129.49308756, 4169.8156682 ])